-- --------------------------------------------------------------------
--  [태석] 여행 / 도시별물가(city_cost)
--  테이블: city_cost
-- --------------------------------------------------------------------
INSERT INTO city_cost
(city_cost_id, country, city, saving_cost, common_cost, premium_cost,
 created_date, created_nm, del_yn)
VALUES
    (1, '일본', '오사카',     49086,  78322, 117886, NOW(), 'jotaeseok', 'N'),
    (2, '일본', '도쿄',       56315,  99263, 155052, NOW(), 'jotaeseok', 'N'),
    (3, '일본', '교토',       60230,  94817, 146154, NOW(), 'jotaeseok', 'N'),
    (4, '일본', '나고야',     58856,  85885, 125304, NOW(), 'jotaeseok', 'N'),
    (5, '일본', '아이치',     53375,  82609, 125941, NOW(), 'jotaeseok', 'N'),
    (6, '일본', '아키타',     45313,  67603, 103001, NOW(), 'jotaeseok', 'N'),
    (7, '일본', '아마가사키', 51131,  84741, 130649, NOW(), 'jotaeseok', 'N'),
    (8, '일본', '아오모리',   53348,  85850, 130649, NOW(), 'jotaeseok', 'N'),
    (9, '일본', '아쓰기',     63738,  84544, 118428, NOW(), 'jotaeseok', 'N'),
    (10, '일본', '벳푸',       59185,  77773, 106458, NOW(), 'jotaeseok', 'N'),
    (11, '일본', '지바',       43742,  76124, 124108, NOW(), 'jotaeseok', 'N'),
    (12, '일본', '에비나',     50896,  80724, 124777, NOW(), 'jotaeseok', 'N'),
    (13, '일본', '후쿠이',     49743,  76133, 112851, NOW(), 'jotaeseok', 'N'),
    (14, '일본', '후쿠오카',   56448,  90685, 134101, NOW(), 'jotaeseok', 'N'),
    (15, '일본', '후쿠시마',   60069, 102682, 151841, NOW(), 'jotaeseok', 'N'),
    (16, '일본', '후쿠야마',   50032,  84405, 137364, NOW(), 'jotaeseok', 'N'),
    (17, '일본', '후나바시',   47455,  65729,  97952, NOW(), 'jotaeseok', 'N'),
    (18, '일본', '기후',       50877,  79516, 118484, NOW(), 'jotaeseok', 'N'),
    (19, '일본', '하치오지',   42583,  92698, 158875, NOW(), 'jotaeseok', 'N'),
    (20, '일본', '하코다테',   64535, 126888, 193112, NOW(), 'jotaeseok', 'N'),
    (21, '베트남', '하노이',     21611, 39577,  59629, NOW(), 'jotaeseok', 'N'),
    (22, '베트남', '호치민',     21198, 39559,  60086, NOW(), 'jotaeseok', 'N'),
    (23, '베트남', '다낭',       22673, 40552,  60950, NOW(), 'jotaeseok', 'N'),
    (24, '베트남', '달랏',       22613, 36107,  52419, NOW(), 'jotaeseok', 'N'),
    (25, '베트남', '하롱베이',   28927, 71028, 112932, NOW(), 'jotaeseok', 'N'),
    (26, '베트남', '깜라인',     22939, 38502,  56552, NOW(), 'jotaeseok', 'N'),
    (27, '베트남', '박장',       20226, 32850,  48021, NOW(), 'jotaeseok', 'N'),
    (28, '베트남', '박닌',       14258, 32082,  52567, NOW(), 'jotaeseok', 'N'),
    (29, '베트남', '비엔호아',   20294, 28966,  40086, NOW(), 'jotaeseok', 'N'),
    (30, '베트남', '빈즈엉',     18058, 34509,  53055, NOW(), 'jotaeseok', 'N'),
    (31, '베트남', '부온마투옷', 22939, 38502,  56552, NOW(), 'jotaeseok', 'N'),
    (32, '베트남', '박깐',       15940, 34034,  54449, NOW(), 'jotaeseok', 'N'),
    (33, '베트남', '까마우',     20259, 37652,  57281, NOW(), 'jotaeseok', 'N'),
    (34, '베트남', '껌파',       20827, 38965,  59186, NOW(), 'jotaeseok', 'N'),
    (35, '베트남', '껀터',       15877, 33840,  53328, NOW(), 'jotaeseok', 'N'),
    (36, '베트남', '디엔비엔푸', 20260, 37653,  57282, NOW(), 'jotaeseok', 'N'),
    (37, '베트남', '동허이',     17987, 36232,  58155, NOW(), 'jotaeseok', 'N'),
    (38, '베트남', '동쏘아이',   17086, 25673,  36496, NOW(), 'jotaeseok', 'N'),
    (39, '베트남', '하동',       20923, 39112,  59384, NOW(), 'jotaeseok', 'N'),
    (40, '대한민국', '부산',     54499,  84499, 124499, NOW(), 'jotaeseok', 'N'),
    (41, '대한민국', '서울',   60367, 105792, 153492, NOW(), 'jotaeseok', 'N'),
    (42, '대한민국', '대구',   57227,  79974, 104371, NOW(), 'jotaeseok', 'N'),
    (43, '대한민국', '대전',   49476,  80026, 113126, NOW(), 'jotaeseok', 'N'),
    (44, '대한민국', '강릉',   43103,  62349,  84012, NOW(), 'jotaeseok', 'N'),
    (45, '대한민국', '춘천',   46144,  71005,  98032, NOW(), 'jotaeseok', 'N'),
    (46, '대한민국', '거제',   52098,  83198, 118798, NOW(), 'jotaeseok', 'N'),
    (47, '대한민국', '안동',   48928,  74336, 101560, NOW(), 'jotaeseok', 'N'),
    (48, '대한민국', '보령',   60067, 105592, 153392, NOW(), 'jotaeseok', 'N'),
    (49, '대한민국', '창원',   49782,  68382,  89982, NOW(), 'jotaeseok', 'N'),
    (50, '대한민국', '천안',   45300,  60050,  78800, NOW(), 'jotaeseok', 'N'),
    (51, '대한민국', '청주',   51748,  83598, 117048, NOW(), 'jotaeseok', 'N'),
    (52, '대한민국', '충주',   54198,  87248, 123098, NOW(), 'jotaeseok', 'N'),
    (53, '대한민국', '안산',   52596,  77536, 105092, NOW(), 'jotaeseok', 'N'),
    (54, '대한민국', '안양',   48269,  72694, 100095, NOW(), 'jotaeseok', 'N'),
    (55, '대한민국', '부천',   60067, 105592, 153392, NOW(), 'jotaeseok', 'N'),
    (56, '대한민국', '김천',   48595,  74090, 101402, NOW(), 'jotaeseok', 'N');


-- --------------------------------------------------------------------
--  [태석] 여행 / 숙박비(hotel_cost)
--  테이블: hotel_cost
-- --------------------------------------------------------------------
INSERT INTO hotel_cost (
    city_cost_id,q1_cost,q2_cost,q3_cost,q4_cost,created_date,created_nm,del_yn
)
VALUES
    -- 일본
    (1,  156000, 182000, 170000, 186000, NOW(), 'jotaeseok', 'N'), -- 오사카
    (2,  174000, 203000, 189000, 207000, NOW(), 'jotaeseok', 'N'), -- 도쿄
    (3,  170000, 199000, 185000, 202000, NOW(), 'jotaeseok', 'N'), -- 교토
    (4,  163000, 190000, 177000, 194000, NOW(), 'jotaeseok', 'N'), -- 나고야
    (5,  160000, 187000, 174000, 190000, NOW(), 'jotaeseok', 'N'), -- 아이치
    (6,  146000, 171000, 159000, 174000, NOW(), 'jotaeseok', 'N'), -- 아키타
    (7,  162000, 189000, 176000, 193000, NOW(), 'jotaeseok', 'N'), -- 아마가사키
    (8,  163000, 190000, 177000, 194000, NOW(), 'jotaeseok', 'N'), -- 아오모리
    (9,  162000, 189000, 176000, 192000, NOW(), 'jotaeseok', 'N'), -- 아쓰기
    (10, 156000, 182000, 170000, 185000, NOW(), 'jotaeseok', 'N'), -- 벳푸
    (11, 154000, 180000, 168000, 183000, NOW(), 'jotaeseok', 'N'), -- 지바
    (12, 158000, 185000, 173000, 188000, NOW(), 'jotaeseok', 'N'), -- 에비나
    (13, 154000, 180000, 168000, 183000, NOW(), 'jotaeseok', 'N'), -- 후쿠이
    (14, 167000, 195000, 182000, 198000, NOW(), 'jotaeseok', 'N'), -- 후쿠오카
    (15, 177000, 206000, 192000, 210000, NOW(), 'jotaeseok', 'N'), -- 후쿠시마
    (16, 162000, 189000, 176000, 192000, NOW(), 'jotaeseok', 'N'), -- 후쿠야마
    (17, 144000, 168000, 157000, 172000, NOW(), 'jotaeseok', 'N'), -- 후나바시
    (18, 157000, 184000, 171000, 187000, NOW(), 'jotaeseok', 'N'), -- 기후
    (19, 169000, 197000, 184000, 200000, NOW(), 'jotaeseok', 'N'), -- 하치오지
    (20, 194000, 227000, 211000, 231000, NOW(), 'jotaeseok', 'N'), -- 하코다테

    -- 베트남
    (21, 167000, 142000, 139000, 170000, NOW(), 'jotaeseok', 'N'), -- 하노이
    (22, 167000, 142000, 139000, 170000, NOW(), 'jotaeseok', 'N'), -- 호치민
    (23, 205000, 175000, 171000, 209000, NOW(), 'jotaeseok', 'N'), -- 다낭
    (24, 160000, 136000, 133000, 163000, NOW(), 'jotaeseok', 'N'), -- 달랏
    (25, 205000, 175000, 171000, 209000, NOW(), 'jotaeseok', 'N'), -- 하롱베이
    (26, 187000, 159000, 156000, 190000, NOW(), 'jotaeseok', 'N'), -- 깜라인
    (27, 153000, 131000, 128000, 156000, NOW(), 'jotaeseok', 'N'), -- 박장
    (28, 152000, 129000, 127000, 155000, NOW(), 'jotaeseok', 'N'), -- 박닌
    (29, 145000, 124000, 121000, 148000, NOW(), 'jotaeseok', 'N'), -- 비엔호아
    (30, 157000, 134000, 131000, 160000, NOW(), 'jotaeseok', 'N'), -- 빈즈엉
    (31, 165000, 140000, 137000, 168000, NOW(), 'jotaeseok', 'N'), -- 부온마투옷
    (32, 156000, 133000, 130000, 159000, NOW(), 'jotaeseok', 'N'), -- 박깐
    (33, 163000, 139000, 136000, 166000, NOW(), 'jotaeseok', 'N'), -- 까마우
    (34, 166000, 141000, 138000, 169000, NOW(), 'jotaeseok', 'N'), -- 껌파
    (35, 156000, 132000, 130000, 158000, NOW(), 'jotaeseok', 'N'), -- 껀터
    (36, 163000, 139000, 136000, 166000, NOW(), 'jotaeseok', 'N'), -- 디엔비엔푸
    (37, 160000, 137000, 134000, 163000, NOW(), 'jotaeseok', 'N'), -- 동허이
    (38, 137000, 117000, 114000, 140000, NOW(), 'jotaeseok', 'N'), -- 동쏘아이
    (39, 166000, 141000, 138000, 169000, NOW(), 'jotaeseok', 'N'), -- 하동

    -- 대한민국
    (40,  70000,  80000, 100000,  75000, NOW(), 'jotaeseok', 'N'), -- 부산
    (41,  85000,  90000,  90000,  95000, NOW(), 'jotaeseok', 'N'), -- 서울
    (42,  60000,  65000,  70000,  65000, NOW(), 'jotaeseok', 'N'), -- 대구
    (43,  60000,  65000,  65000,  65000, NOW(), 'jotaeseok', 'N'), -- 대전
    (44,  65000,  75000, 110000,  70000, NOW(), 'jotaeseok', 'N'), -- 강릉
    (45,  60000,  70000,  90000,  65000, NOW(), 'jotaeseok', 'N'), -- 춘천
    (46,  65000,  75000, 100000,  70000, NOW(), 'jotaeseok', 'N'), -- 거제
    (47,  55000,  60000,  70000,  65000, NOW(), 'jotaeseok', 'N'), -- 안동
    (48,  55000,  65000, 105000,  60000, NOW(), 'jotaeseok', 'N'), -- 보령
    (49,  55000,  65000,  70000,  65000, NOW(), 'jotaeseok', 'N'), -- 창원
    (50,  55000,  60000,  65000,  65000, NOW(), 'jotaeseok', 'N'), -- 천안
    (51,  55000,  60000,  65000,  60000, NOW(), 'jotaeseok', 'N'), -- 청주
    (52,  55000,  65000,  85000,  60000, NOW(), 'jotaeseok', 'N'), -- 충주
    (53,  55000,  60000,  65000,  60000, NOW(), 'jotaeseok', 'N'), -- 안산
    (54,  60000,  65000,  65000,  65000, NOW(), 'jotaeseok', 'N'), -- 안양
    (55,  55000,  60000,  60000,  60000, NOW(), 'jotaeseok', 'N'), -- 부천
    (56,  50000,  55000,  60000,  55000, NOW(), 'jotaeseok', 'N'); -- 김천



-- --------------------------------------------------------------------
--  [태석] 여행 / 항공비(flight_cost)
--  테이블: flight_cost
-- --------------------------------------------------------------------
INSERT INTO flight_cost (
    city_cost_id,q1_cost,q2_cost,q3_cost,q4_cost,created_date,created_nm,del_yn
)
VALUES
    -- 일본
    (1, 300000, 320000, 350000, 330000,
     NOW(), 'jotaeseok', 'N'),

    (2, 380000, 340000, 290000, 400000,
     NOW(), 'jotaeseok', 'N'),

    (3, 300000, 320000, 350000, 330000,
     NOW(), 'jotaeseok', 'N'),

    (4, 340000, 320000, 300000, 350000,
     NOW(), 'jotaeseok', 'N'),

    (5, 340000, 320000, 300000, 350000,
     NOW(), 'jotaeseok', 'N'),

    (6, 430000, 400000, 420000, 450000,
     NOW(), 'jotaeseok', 'N'),

    (7, 300000, 320000, 350000, 330000,
     NOW(), 'jotaeseok', 'N'),

    (8, 390000, 380000, 410000, 420000,
     NOW(), 'jotaeseok', 'N'),

    (9, 420000, 400000, 380000, 430000,
     NOW(), 'jotaeseok', 'N'),

    (10, 350000, 320000, 330000, 360000,
     NOW(), 'jotaeseok', 'N'),

    (11, 380000, 340000, 290000, 400000,
     NOW(), 'jotaeseok', 'N'),

    (12, 420000, 400000, 380000, 430000,
     NOW(), 'jotaeseok', 'N'),

    (13, 360000, 330000, 340000, 370000,
     NOW(), 'jotaeseok', 'N'),

    (14, 280000, 260000, 290000, 300000,
     NOW(), 'jotaeseok', 'N'),

    (15, 360000, 340000, 350000, 380000,
     NOW(), 'jotaeseok', 'N'),

    (16, 340000, 320000, 330000, 350000,
     NOW(), 'jotaeseok', 'N'),

    (17, 380000, 340000, 290000, 400000,
     NOW(), 'jotaeseok', 'N'),

    (18, 340000, 320000, 300000, 350000,
     NOW(), 'jotaeseok', 'N'),

    (19, 420000, 400000, 380000, 430000,
     NOW(), 'jotaeseok', 'N'),

    (20, 420000, 400000, 440000, 430000,
     NOW(), 'jotaeseok', 'N'),

    -- 베트남
    (21, 430000, 380000, 450000, 420000,
     NOW(), 'jotaeseok', 'N'),

    (22, 470000, 420000, 480000, 450000,
     NOW(), 'jotaeseok', 'N'),

    (23, 430000, 370000, 420000, 450000,
     NOW(), 'jotaeseok', 'N'),

    (24, 500000, 450000, 480000, 520000,
     NOW(), 'jotaeseok', 'N'),

    (25, 430000, 380000, 450000, 420000,
     NOW(), 'jotaeseok', 'N'),

    (26, 450000, 400000, 460000, 470000,
     NOW(), 'jotaeseok', 'N'),

    (27, 430000, 380000, 450000, 420000,
     NOW(), 'jotaeseok', 'N'),

    (28, 430000, 380000, 450000, 420000,
     NOW(), 'jotaeseok', 'N'),

    (29, 470000, 420000, 480000, 450000,
     NOW(), 'jotaeseok', 'N'),

    (30, 470000, 420000, 480000, 450000,
     NOW(), 'jotaeseok', 'N'),

    (31, 450000, 400000, 460000, 470000,
     NOW(), 'jotaeseok', 'N'),

    (32, 430000, 380000, 450000, 420000,
     NOW(), 'jotaeseok', 'N'),

    (33, 470000, 420000, 480000, 450000,
     NOW(), 'jotaeseok', 'N'),

    (34, 430000, 380000, 450000, 420000,
     NOW(), 'jotaeseok', 'N'),

    (35, 470000, 420000, 480000, 450000,
     NOW(), 'jotaeseok', 'N'),

    (36, 430000, 380000, 450000, 420000,
     NOW(), 'jotaeseok', 'N'),

    (37, 430000, 370000, 420000, 450000,
     NOW(), 'jotaeseok', 'N'),

    (38, 470000, 420000, 480000, 450000,
     NOW(), 'jotaeseok', 'N'),

    (39, 430000, 380000, 450000, 420000,
     NOW(), 'jotaeseok', 'N');



-- --------------------------------------------------------------------
--  [태석] 여행 / 여행패키지상품(travel_package)
--  테이블: travel_package
-- --------------------------------------------------------------------
INSERT INTO travel_package
(package_id, goods_code, country, region_name, name, image_url, description,
 min_price, departure_period, crawled_at, is_active, detail_url,
 created_date, created_nm, del_yn)
VALUES
    (1, 'AVP4484', '베트남', '다낭',
     '다낭/호이안 5일',
     'https://dimgcdn.ybtour.co.kr/TN/79/798308110f991d072ac7a24eea0e6da9.tn.410x280.jpg',
     '#5성 #NO옵션NO팁 #호이안야간투어 #마사지2회 #럭셔리크루즈',
     569900, '2026.07.22~2027.06.30', NOW(), TRUE,
     'https://prdt.ybtour.co.kr/product/detailPackage?menu=PKG&goodsCd=AVP4484',
     NOW(), 'jotaeseok', 'N'),

    (2, 'AVP4474', '베트남', '다낭',
     '부산출발 다낭/호이안 5/6일',
     'https://dimgcdn.ybtour.co.kr/TN/79/798308110f991d072ac7a24eea0e6da9.tn.410x280.jpg',
     '#노팁 #노옵션 #씨클로 #과일바구니증정 #5성급호텔',
     599000, '2026.07.22~2027.03.31', NOW(), TRUE,
     'https://prdt.ybtour.co.kr/product/detailPackage?menu=PKG&goodsCd=AVP4474',
     NOW(), 'jotaeseok', 'N'),

    (3, 'AVP1202', '베트남', '하노이',
     '하노이/하롱베이/옌뜨 4/5/6일',
     'https://dimgcdn.ybtour.co.kr/TN/77/771299e08968c64ad3627cdda4760b68.tn.410x280.jpg',
     '#노옵션#크루즈디너뷔페#씨푸드+비경스피보트#1일1커피',
     549000, '2026.08.16~2026.09.24', NOW(), TRUE,
     'https://prdt.ybtour.co.kr/product/detailPackage?menu=PKG&goodsCd=AVP1202',
     NOW(), 'jotaeseok', 'N'),

    (4, 'JOP1190', '일본', '오사카',
     '[USJ부터자유일정까지]오사카4일',
     'https://dimgcdn.ybtour.co.kr/TN/7b/7b0fa486c79aa70155626ab4a8d9f3eb.tn.410x280.jpg',
     '#취향따라골라가는/오사카,교토,고베,아라시야마',
     599000, '2026.07.26~2027.03.31', NOW(), TRUE,
     'https://prdt.ybtour.co.kr/product/detailPackage?menu=PKG&goodsCd=JOP1190',
     NOW(), 'jotaeseok', 'N');


-- --------------------------------------------------------------------
--  [태석] 여행 / 여행보험(travel_insurance)
--  테이블: travel_insurance
-- --------------------------------------------------------------------
INSERT INTO travel_insurance (
    insurance_id, title, insurance_inf, insurance_period, insurance_url,
    created_date, created_nm, del_yn
) VALUES (
             1,
             'KB 해외여행보험',
             '해외여행 중 상해·질병 의료비, 휴대품 파손·도난, 배상책임, 항공기 지연, 여권 재발급, 구조·송환비 등 보장. 기후질환 진단비 및 지수형 항공기 지연 특약 포함',
             90,
             'https://direct.kbinsure.co.kr/home/#/GL/OT/GN_CM0101M/otrav_step?pid=6110972&code=5524',
             NOW(),
             'jotaeseok',
             'N'
         );